2차원 형태인 DataFrame

In [1]:
import pandas as pd

In [2]:
print(pd.DataFrame)

<class 'pandas.core.frame.DataFrame'>

In [4]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

print(dict_data)

{'c0': [1, 2, 3], 'c1': [4, 5, 6], 'c2': [7, 8, 9], 'c3': [10, 11, 12], 'c4': [13, 14, 15]}

#### 딕셔너리 형태의 데이터를 DataFrame으로 변환
#### key 값은 columns으로 변환됨

In [7]:
df = pd.DataFrame(dict_data)

In [8]:
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

#### columns과 index에 각각 name을 지정할 수 있고 아래와 같이 표현됨
#### (왠만하면 명시적 지정을 해두는게 좋을듯)

In [16]:
df.columns.name = 'columns_name'
df.index.name = 'index_name'

In [17]:
df

columns_name  c0  c1  c2  c3  c4
index_name
0              1   4   7  10  13
1              2   5   8  11  14
2              3   6   9  12  15

#### columns이든 index든 설정값이 없으면 rangeindex로 설정됨(default)

In [10]:
df.columns

Index(['c0', 'c1', 'c2', 'c3', 'c4'], dtype='object', name='temp')

In [18]:
df.index

RangeIndex(start=0, stop=3, step=1, name='index_name')

In [32]:
df_noneSet = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']])

In [33]:
df_noneSet

    0  1    2
0  15  남  덕영중
1  17  여  수리중

#### Series와 동일하게 테이블 속성에 대해 지정 가능하나 2차원이므로 index에 columns까지 지정가능
#### (리스트 형식)

In [20]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']], 
                   index=['준서', '예은'],
                   columns=['나이', '성별', '학교'])

In [21]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [22]:
df.index

Index(['준서', '예은'], dtype='object')

#### 튜플이나 리스트로도 DataFrame을 생성할 수는 있으나 딕셔너리와 다르게 Key값이 없기때문에 별도로 지정 필요 없다면 RangeIndex로 설정됨

In [41]:
# 튜플로 DataFrame 생성
columns = ['Name', 'Age', 'City']
data = [
    ('Alice', 25, 'New York'),
    ('Bob', 30, 'Los Angeles'),
    ('Charlie', 35, 'Chicago')
]

df_tuple = pd.DataFrame(data, columns=columns)

In [43]:
df_tuple

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [44]:
# 리스트로 DataFrame 생성
columns = ['Name', 'Age', 'City']

data = [
    ['Alice', 25, 'New York'],
    ['Bob', 30, 'Los Angeles'],
    ['Charlie', 35, 'Chicago']
]


df_list = pd.DataFrame(data, columns=columns)

In [45]:
df_list

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

#### columns, index 모두 rename(딕셔너리 형식, inplace=true)로 이름 변경 가능
#### inplace=true는 직접 해당 DataFrame을 변경한다는 설정이고 False인 경우 변경된 DataFrame 객체를 생성하여 반환

In [46]:
df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'}, inplace=True)

In [47]:
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [51]:
df_rename_inplace_False = df.rename(columns={'연령':'나이', '남녀':'성별', '소속':'학교'}, inplace=False)

In [52]:
df_rename_inplace_False

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [53]:
df.rename(index={'준서':'학생1', '예은':'학생2' }, inplace=True)

In [54]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [55]:
df_rename_inplace_False = df.rename(index={'준서':'학생1', '예은':'학생2' }, inplace=False)

In [56]:
df_rename_inplace_False

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [86]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
# 실 데이터를 변수 형태로 넘겨도 됨
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

In [87]:
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

#### SettingWithCopyWarning로 인해 copy() 사용하는게 좋음

In [88]:
# 전체 데이터를 df2로 복사 후 행 삭제
df2 = df[:]
df2.drop('우현', inplace=True)

C:\Users\ezen\AppData\Local\Temp\ipykernel_10496\98881453.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('우현', inplace=True)

In [89]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

#### sallow copy

In [108]:
# 데이터프레임 df를 복제하여 변수 df3에 저장. df3의 2개 행(row)을 삭제

df_sallow = df
df_sallow.drop(['우현', '인아'], axis=0, inplace=True)
df_sallow

    수학  영어  음악   체육
서준  90  98  85  100

In [93]:
# 원본 데이터도 변경됨
df

    수학  영어  음악   체육
서준  90  98  85  100

In [95]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

In [100]:
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

#### 열 삭제를 하는 경우 axis =1 옵션은 필수값이 됨
#### 행 삭제는 생략 가능

In [103]:
df_col_ex1 = df.copy()
df_col_ex1.drop('수학', axis=1, inplace=True)
df_col_ex1

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [107]:
df_col_ex2 = df.copy()
df_col_ex2.drop(['영어', '음악'], axis=1, inplace=True)
df_col_ex2

    수학   체육
서준  90  100
우현  80   90
인아  70   90